Python Data Science Handbook by Jake VanderPlas 
[Link](https://jakevdp.github.io/PythonDataScienceHandbook/)

# Chapter: Data Manipulation with Pandas

In [ ]:
# to display all the contents of the pandas namespace, you can type
pd.<TAB>

# to display Pandas's built-in documentation, you can use this:
pd?

# Introducting Pandas Objects

## The Pandas Series Object

In [1]:
import numpy as np
import pandas as pd

In [3]:
# a pandas series is a 1d array of indexed data
# can be created from a list or array as follows
data = pd.Series([0.25, 0.5, 0.75, 1.0])

In [4]:
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [5]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [6]:
# The index is an array-like object of type pd.Index
data.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
# data can be accessed by associated index via familiar python square-bracket notation
data[1]

0.5

In [8]:
data[1:3]

1    0.50
2    0.75
dtype: float64

### [series] as a generalised NumPy array

In [2]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                index = ['a', 'b', 'c', 'd' ])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [3]:
data['b']

0.5

In [4]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
index = [2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [5]:
data[5]

0.5

### Series as specialised dictionary

- Pandas [series] -> like a specialised python dictionary
- dictionary is a sgtructure which maps arbitrary keys to a set of values
- a [series] is a structure which maps typed keys to a set of values

In [4]:
population_dict = {'California': 38332521,
                   'Texas':      26448193,
                   'New York':   19651127,
                   'Florida':    19552860,
                   'Illinois':   12882135 }

population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

- a series will be created where the index is drawn from the sorted keys.

In [7]:
population['California']

38332521

In [8]:
# series (unlike dictoinary) supports array-style operations like slicing
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

### Consructing Series objects

- constructing pandas series from scratch
- pd.Series(data, index=index)
- index optional

In [9]:
#data can be a list or NumPy array, index defaults to integer seq
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [10]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [11]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

## The Pandas DataFrame Object

- [Series] is an analog of a 1d array
- [dataframe] is an analog of 2d array
- dataframe a sequence of aligned series obj (alighned = share same index)

In [2]:
import pandas as pd

In [3]:
# construct a new series

area_dict = {'California': 423967, 'Texas': 695662,
             'New York': 695662,   'Florida': 170312,
             'Illinois': 149995 }
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      695662
Florida       170312
Illinois      149995
dtype: int64

In [5]:
# add population
# create a 2d object using dictionary

states = pd.DataFrame({'popluation': population,
                       'area': area })

states

            popluation    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  695662
Florida       19552860  170312
Illinois      12882135  149995

In [6]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [7]:
states.columns

Index(['popluation', 'area'], dtype='object')

Dataframe as a specialized dictionary

In [8]:
#dataframe specialised dictionary
# dict maps a key to a value
# dataframe maps a col name to a series of col data

states['area']

California    423967
Texas         695662
New York      695662
Florida       170312
Illinois      149995
Name: area, dtype: int64

Constructing dataframe objects

- pandas dataframe can be constructed in a variety of ways
- examples below

from  a single Series object

In [9]:
## 

# a df is a collection of Series objects
# a single col dataframe can be constructed from a single Series

pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

from a list of dicts

In [10]:
data = [{'a': i, 'b': 2 * i}
        for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [12]:
pd.DataFrame([{'a':1, 'b':2}, {'b':3, 'c':4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

From a dictionary of series objects

In [13]:
pd.DataFrame({'population': population,
               'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  695662
Florida       19552860  170312
Illinois      12882135  149995

In [15]:
import numpy as np

From a 2d numpy array

In [16]:
pd.DataFrame(np.random.rand(3,2),
            columns=['foo','bar'],
            index=['a','b','c'])

        foo       bar
a  0.145524  0.624846
b  0.985889  0.485589
c  0.007081  0.555367

from a numpy structured array

In [17]:
A = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
A

array([(0, 0.), (0, 0.), (0, 0.)], dtype=[('A', '<i8'), ('B', '<f8')])

In [18]:
pd.DataFrame(A)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

# the pandas index object

In [19]:
# construct an index from a list of integers
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

index as immutable
array

In [20]:
# can use standard indexing to retrieve values or slices
ind[1]

3

In [21]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [22]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [23]:
#indices cant be modified via normal means
ind[1] = 1

TypeError: Index does not support mutable operations

index as ordered set

In [24]:
indA = pd.Index([1,2,3,4,5])
indB = pd.Index([9,2,3,4,8])

In [25]:
indA & indB #intersection

/tmp/ipykernel_431/1860335538.py:1: FutureWarning: Index.__and__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__and__.  Use index.intersection(other) instead.
  indA & indB #intersection

Int64Index([2, 3, 4], dtype='int64')

In [26]:
indA | indB #union

/tmp/ipykernel_431/2837849747.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  indA | indB #union

Int64Index([1, 2, 3, 4, 5, 8, 9], dtype='int64')

In [27]:
indA ^ indB #symmetric difference

/tmp/ipykernel_431/2613523914.py:1: FutureWarning: Index.__xor__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__xor__.  Use index.symmetric_difference(other) instead.
  indA ^ indB #symmetric difference

Int64Index([1, 5, 8, 9], dtype='int64')

# Data indexing and selection

https://jakevdp.github.io/PythonDataScienceHandbook/03.02-data-indexing-and-selection.html

Data selection in Series

- series as a dictionary

In [28]:
# mapped keys to a collection of values
import pandas as pd

data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index = ['a', 'b', 'c', 'd'])

data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [29]:
data['b']

0.5

In [30]:
'a' in data

True

In [31]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [32]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [33]:
# can add/extend series with new values

data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

series as a 1d array

In [34]:
#slicing by explicit index

data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [35]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

In [36]:
#masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [37]:
# fancy indexing
data[['a',  'e']]

a    0.25
e    1.25
dtype: float64

indexers: loc, iloc, ix

In [38]:
data = pd.Series(['s', 'b', 'f'], index = [1,3,5])

In [39]:
data

1    s
3    b
5    f
dtype: object

In [40]:
#explicit index when indexing
data[1]

's'

In [41]:
#implicit index when slicing
data[1:3]

3    b
5    f
dtype: object

In [42]:
# loc attributed allows indexing and slicing ref explicit index
data.loc[1]

's'

In [43]:
data.loc[1:3]

1    s
3    b
dtype: object

In [44]:
data.iloc[1]

'b'

In [45]:
data.iloc[1:3]

3    b
5    f
dtype: object

Data selection in dataframe

In [46]:
#data frame as a dictionary

In [47]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [48]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [49]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [50]:
data.area is data['area']

True

In [51]:
data.pop is data['pop']

False

In particular, you should avoid the temptation to try column assignment via attribute (i.e., use data['pop'] = z rather than data.pop = z).

In [53]:
data['density'] = data['pop'] / data['area']

In [54]:
data['density']

California     90.413926
Texas          38.018740
New York      139.076746
Florida       114.806121
Illinois       85.883763
Name: density, dtype: float64

dataframe as 2d array

In [55]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [56]:
#transpose
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [57]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [58]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [60]:
#for array style indexing use iloc
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [61]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [62]:
# The ix indexer allows a hybrid of these two approaches:

data.ix[:3, :'pop']

AttributeError: 'DataFrame' object has no attribute 'ix'

In [63]:
# the loc indexer we can combine masking and fancy indexing as in the following:

data.loc[data.density > 100, ['pop',    'density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

In [64]:
# modify values
data.iloc[0,2] = 90

In [65]:
data

              area       pop     density
California  423967  38332521   90.000000
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

- indexing refers to colmns
- slicing refers to rows

In [67]:

data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [68]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [69]:
data[data.density > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

Operating on data in pandas

- ufuncs: index preservation
- numpy ufunc will work on any pandas series and dataframe obj

In [70]:
import pandas as pd
import numpy as np

In [71]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))

In [72]:
ser

0    6
1    3
2    7
3    4
dtype: int64

In [73]:
df = pd.DataFrame(rng.randint(0,10,(3,4)),
                    columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

now if apply numpy ufunc on either above objects, results will be another pandas object wth the indices predserved

In [74]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [75]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

ufuncs  index   alignment
- index alignment in series

In [76]:
# example combining two different data sources
# find top 3 us states by area
# find top 3 us states by populaton

In [77]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')

population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [78]:
# calc population density

population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [79]:
# only have results for overlapping indices
area.index | population.index

/tmp/ipykernel_431/1002832183.py:2: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [80]:
# anything thats NaN (not a number) due to index mismatching

In [81]:
A = pd.Series([2, 4, 6], index =[0,1,2])
B = pd.Series([1, 3, 5], index =[1,2,3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [82]:
# modify fill value

A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

- index alignment in dataframe

In [86]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                    columns=list('AB'))

A

    A   B
0  19   2
1   4  18

In [85]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [87]:
A + B

      A     B   C
0  19.0   6.0 NaN
1  12.0  23.0 NaN
2   NaN   NaN NaN

In [89]:
# fill any missing values with the mean of all values in A
# compute by first stacking the rows of A
fill = A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
0  19.00   6.00  19.75
1  12.00  23.00  10.75
2  12.75  19.75  16.75


Python Operator	Pandas Method(s)
+	add()
-	sub(), subtract()
*	mul(), multiply()
/	truediv(), div(), divide()
//	floordiv()
%	mod()
**	pow()

Ufuncs: Operations Between DataFrame and Series

In [90]:
A = rng.randint(10, size=(3,4))
A

array([[6, 4, 8, 6],
       [1, 3, 8, 1],
       [9, 8, 9, 4]])

In [91]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-5, -1,  0, -5],
       [ 3,  4,  1, -2]])

In [92]:
# subtraction applied row wise
df = pd.DataFrame(A, columns = list('QRST'))

df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1 -5 -1  0 -5
2  3  4  1 -2

In [93]:
# to operate col wise, specify axis

df.subtract(df['R'], axis = 0)

   Q  R  S  T
0  2  0  4  2
1 -2  0  5 -2
2  1  0  1 -4

In [94]:
halfrow = df.iloc[0, ::2]
halfrow

Q    6
S    8
Name: 0, dtype: int64

In [95]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -5.0 NaN  0.0 NaN
2  3.0 NaN  1.0 NaN

# Handling missing data

https://jakevdp.github.io/PythonDataScienceHandbook/03.04-missing-values.html

- built in daratools for missing data
- Missing data detection:
    - Masking approach: globally indicate missing values. Mask may be a separate boolean array,
    - Senintel value: indicate missing entry could be some data-specific convention, such as indicating a missing integer value with -9999 or some rare bit pattern, or it could be a more global convention, such as indicating a missing floating-point value with NaN (Not a Number), a special value which is part of the IEEE floating-point specification.

- Trade-offs:
    - Boolean masl - additional storage and computation
    - Sentinel - reduces range of valid values that can be represented, may require logic in CPU and GPU arithmetic. NaN not available for all data types.
    - R uses reserved bit patterns within each data type as sentinel values to indicate missing data

Missing data in pandas
- Relies on NumPy package (which doenst have a built in notion of NA values for non floating point data types)

- R has a single integer type and 4 basic data types, but NumPy supports 14 basic integer types
- To reserve a specific bit pattern in all NumPy data types would lead to lots of overhead in special-case operations for various types
- NumPy does support masked arrays which have a separate Boolean mask array attached. But overhead in storage, computation and code maintenance means unattractive
- Pandas uses sentinels for missing data
- Uses NaN (special floating point value) and None obj

Pythonic missing data
- First sentinel value used by Pandas is [None]
- only used in arrays with type 'object'

In [3]:
import pandas as pd
import numpy as np

In [4]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [98]:

# dtype = object, means best common type representation for contents were objects

In [5]:
for dtype in ['object', 'int']:
    print("dtype =", dtype)
    %timeit np.arange(1E6, dtype=dtype).sum()
    print()

dtype = object
39.2 ms  1.62 ms per loop (mean  std. dev. of 7 runs, 10 loops each)

dtype = int
1.25 ms  42.7 s per loop (mean  std. dev. of 7 runs, 1000 loops each)

- use of obj lead to errors when performing aggregations (like sum, min) when you have a None value

In [6]:
vals1.sum()
# addition of integer and NONE is undefined

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

Missing numerical data
- NaN (Not a number) is a special floating point value recog by all systems using standard IEEE floating point representation

In [7]:
vals2 = np.array([1, np.nan, 3, 4])
vals2.dtype

dtype('float64')

In [8]:
1 + np.nan

nan

In [9]:
0 * np.nan

nan

In [10]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

## NaN and None in pandas

- pandas handles both NaN and None

In [14]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int32

In [15]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

## Operating on Null values

- isnull(): Generate a boolean mask indicating missing values
- notnull(): Opposite of isnull()
- dropna(): Return a filtered version of the data
- fillna(): Return a copy of the data with missing values filled or imputed

### Detecting Null values

In [17]:
# to detect null data -> isnull() and notnull()

data = pd.Series([1, np.nan, 'hello', None])

In [18]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [19]:
data[data.notnull()]

0        1
2    hello
dtype: object

## Dropping null values

In [20]:
# drop na

data.dropna()

0        1
2    hello
dtype: object

In [21]:
df = pd.DataFrame([[1,      np.nan, 2],
                   [2,      3,      5],
                   [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [22]:
# cannot drop single values frm a DataFrame, only dropp full rows or cols
# dropna gives a number of options for a DataFrame

df.dropna()

     0    1  2
1  2.0  3.0  5

In [23]:
# drop along an axis
df.dropna(axis = 'columns')

   2
0  2
1  5
2  6

In [24]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [25]:
# use how='all', to drop cols/rows that are all null values

df.dropna(axis = 'columns', how = 'all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [27]:
# use thresh for finer control, specify min number of non-null values for the row/col to be kept

df.dropna(axis = 'rows', thresh = 3)

     0    1  2   3
1  2.0  3.0  5 NaN

### Filling null values

In [31]:
# replace NA values

data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [33]:
#fill with 0
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [35]:
# fill with previous value fwd

data.fillna(method = 'ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [36]:
# back fill with next backward values

data.fillna(method = 'bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [37]:
# dataframe option similar, specify an axis for fills

df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [38]:
df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0

# Heirarchical Indexing
[Link]('https://jakevdp.github.io/PythonDataScienceHandbook/03.05-hierarchical-indexing.html')

- also known as multi-indexing
- incorporate multiple index levels within a single index.
- higher-dimensional data can be compactly represented within the familiar one-dimensional Series and two-dimensional DataFrame objects.
- Explore multi-index objects

In [39]:
import pandas as pd
import numpy as np

## Multiply indexed series

In [49]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [52]:
# tuple_based indexing

index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [53]:
pop = pop.reindex(index)
pop

# heirachnical representation of data
# first two columns show multiple index values, third col is data

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### Multiindex as extra dimension

- **unstack()** will quickly convert a multiplied indexed series into a Dataframe

In [54]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [55]:
# stack() reverses this

pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [56]:
# add another demographic data col

pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [57]:
# Calc people under 18 by year (fraction)

f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack

<bound method Series.unstack of California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64>

## Methods of multiindex creation

In [58]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.278952  0.437157
  2  0.540652  0.885228
b 1  0.439264  0.262567
  2  0.152603  0.490000

In [59]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

### Explicit multi-index constructors

In [60]:
pd.MultiIndex.from_arrays([['a', 'a', 'b', 'b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [61]:
# can construct from list of tuples giving the multiple index values of each point

pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [62]:
# can construct from a Cartesian product of single indices
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

### Multi-index level names

- name levels of the multiindex
- pass the 'names' argument or set 'names attribute

In [65]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### Multi-index for columns

In [66]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

In [67]:
# mock data

data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

In [68]:
# create df

health_data = pd.DataFrame(data, index = index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      17.0  37.0  39.0  38.7  53.0  35.9
     2      20.0  37.3  16.0  36.4  31.0  35.6
2014 1      44.0  38.5  29.0  35.5  42.0  37.4
     2      45.0  36.9  50.0  36.1  32.0  38.3

In [69]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      39.0  38.7
     2      16.0  36.4
2014 1      29.0  35.5
     2      50.0  36.1

## Indexing and slicing a multi-index

### Multiply indexed series

In [70]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [71]:
# access element
pop['California', 2000]

33871648

In [72]:
# access a series
pop['California']

year
2000    33871648
2010    37253956
dtype: int64

In [73]:
# Partial slicing
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [74]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [75]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [76]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

### Multiply indexed DataFrames

In [77]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      17.0  37.0  39.0  38.7  53.0  35.9
     2      20.0  37.3  16.0  36.4  31.0  35.6
2014 1      44.0  38.5  29.0  35.5  42.0  37.4
     2      45.0  36.9  50.0  36.1  32.0  38.3

In [78]:
health_data['Guido', 'HR']

year  visit
2013  1        39.0
      2        16.0
2014  1        29.0
      2        50.0
Name: (Guido, HR), dtype: float64

In [79]:
# can use loc, iloc and ix

health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      17.0  37.0
     2      20.0  37.3

In [80]:
health_data.loc[:, ('Bob', 'HR')]

year  visit
2013  1        17.0
      2        20.0
2014  1        44.0
      2        45.0
Name: (Bob, HR), dtype: float64

In [81]:
# Working with slices within these index tuples is not especially convenient; trying to create a slice within a tuple will lead to a syntax error
health_data.loc[(:, 1), (:, 'HR')]

SyntaxError: invalid syntax (21378676.py, line 2)

In [83]:
# instead use 'IndexSlice' 
idx = pd.IndexSlice
health_data.loc[idx[:, 1], idx[:, 'HR']]

subject      Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      17.0  39.0  53.0
2014 1      44.0  29.0  42.0

##  Rearranging multi-indices

- how to transform data

### Sorted and unsorted indices
- Many of the MultiIndex slicing operations will fail if the index is not sorted

In [84]:
# multiply indexed data where the indices are not lexographically sorted:

index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data  = pd.Series(np.random.rand(6), index = index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.941547
      2      0.592751
c     1      0.828484
      2      0.731029
b     1      0.923079
      2      0.519260
dtype: float64

- partial slice will be an error as it is unsorted

In [87]:
# sort index

data = data.sort_index()
data

char  int
a     1      0.941547
      2      0.592751
b     1      0.923079
      2      0.519260
c     1      0.828484
      2      0.731029
dtype: float64

In [88]:
data['a':'b']

char  int
a     1      0.941547
      2      0.592751
b     1      0.923079
      2      0.519260
dtype: float64

### Stacking and unstacking indices

Convert a dataset from a ulti-stacked index, can specify level to use

In [89]:
pop.unstack(level = 0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [90]:
pop.unstack(level = 1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [91]:
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

### index setting and resetting

- Another way to rearrange hierarchical data is to turn the index labels into columns
- use the reset_index method. 
- Calling this on the population dictionary will result in a DataFrame with a state and year column holding the information that was formerly in the index. For clarity, we can optionally specify the name of the data for the column representation:

In [93]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

Often when working with data in the real world, the raw input data looks like this and it's useful to build a MultiIndex from the column values. This can be done with the set_index method of the DataFrame, which returns a multiply indexed DataFrame:

In [94]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## Data aggregations on multi-indices

We've previously seen that Pandas has built-in data aggregation methods, such as mean(), sum(), and max(). For hierarchically indexed data, these can be passed a level parameter that controls which subset of the data the aggregate is computed on.

In [95]:
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      17.0  37.0  39.0  38.7  53.0  35.9
     2      20.0  37.3  16.0  36.4  31.0  35.6
2014 1      44.0  38.5  29.0  35.5  42.0  37.4
     2      45.0  36.9  50.0  36.1  32.0  38.3

In [96]:
# average out measurements in the two visits each year,
# name the index level we'd like to explore

data_mean = health_data.mean(level='year')
data_mean

C:\Users\Jaz\AppData\Local\Temp\ipykernel_20764\3306756859.py:4: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean = health_data.mean(level='year')

subject   Bob        Guido          Sue
type       HR   Temp    HR   Temp    HR   Temp
year
2013     18.5  37.15  27.5  37.55  42.0  35.75
2014     44.5  37.70  39.5  35.80  37.0  37.85

In [97]:
data_mean.mean(axis=1, level='type')

C:\Users\Jaz\AppData\Local\Temp\ipykernel_20764\1641729190.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.median(level=1) should use df.groupby(level=1).median().
  data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  29.333333  36.816667
2014  40.333333  37.116667

# Combining Datasets: Concat and Append

[link]('https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html')

- combining data sources

In [1]:
import pandas as pd
import numpy as np

In [2]:
# quickly make a dataframe

def make_df(cols, ind):
    """Quickly make a dataframe"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example dataframe
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [3]:
# a class to display multiple dataframes side by side using _repr_html to implement rich object display

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""

    def __init__(self, *args):
        self.args = args

    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

## Recall: Concatenation of NuPy Arrays

In [4]:
# using np.concatenate to combine contents of 2+ arrays into a single array

x = [1,2,3]
y = [4,5,6]
z = [7,8,9]

np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [5]:
# to concatenate along a specified axis

x = [[1,2],
    [3,4]]

np.concatenate([x,x], axis = 1)

array([[1, 2, 1, 2],
       [3, 4, 3, 4]])

## Simple concatentation with *pd.concat*
- pd.concat() can be used for a simple concatenation of series/dataframe obj
- np.concatenate() can be used for simple concatenations of arrays:

In [6]:
ser1 = pd.Series(['A', 'B', 'C'], index=[1,2,3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4,5,6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [8]:
# concatenate higher dimensional obj such as dfs
df1 = make_df('AB', [1,2])
df2 = make_df('AB', [3,4])
display('df1', 'df2', 'pd.concat([df1,df2])')

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

pd.concat([df1,df2])
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [16]:
# default concat will ovvur row-wise (ie axis = 0)
# can specify along an axis

df3 = make_df('AB', [0,1])
df4 = make_df('CD', [0,1])
display('df3', 'df4', "pd.concat([df3, df4], axis=1)")

df3
    A   B
0  A0  B0
1  A1  B1

df4
    C   D
0  C0  D0
1  C1  D1

pd.concat([df3, df4], axis=1)
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

### Duplicate indices
- pandas concat (pd.concat) preserves indices vs np.concatenate

In [17]:
x = make_df('AB', [0, 1])
y = make_df('AB', [2, 3])
y.index = x.index  # make duplicate indices!
display('x', 'y', 'pd.concat([x, y])')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y])
    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [18]:
# check indices don't overlap with *verify_integrity*
try:
    pd.concat([x, y], verify_integrity=True)
except ValueError as e:
    print("ValueError:", e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

### Ignoring the index

In [19]:
display('x', 'y', 'pd.concat([x, y], ignore_index = True)')

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x, y], ignore_index = True)
    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

### Adding multiIndex keys

In [21]:
# use keys to specify a label for data sources - result will be heirachally indexed series containing data

display('x', 'y', "pd.concat([x,y], keys = ['x', 'y'])")

x
    A   B
0  A0  B0
1  A1  B1

y
    A   B
0  A2  B2
1  A3  B3

pd.concat([x,y], keys = ['x', 'y'])
      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

### Concatenation with joins

In [22]:
# joining df with non overlapping and overlapping values

df5 = make_df('ABC', [1,2])
df6 = make_df('BCD', [3,4])
display('df5', 'df6', 'pd.concat([df5, df6])')

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6])
     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [23]:
display('df5', 'df6',
        "pd.concat([df5, df6], join='inner')")

df5
    A   B   C
1  A1  B1  C1
2  A2  B2  C2

df6
    B   C   D
3  B3  C3  D3
4  B4  C4  D4

pd.concat([df5, df6], join='inner')
    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

### The append() method
- instead of calling pd.concat([df1, df2]), you can simply call df1.append(df2)
- keep in mind not efficient, creates a new index and data buffer
- if plan to do multiple append operations, its vetter to build a list of dataframes and pass them all at once to the concat() function

In [31]:
display('df1', 'df2', 'df1.append(df2)')

<string>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
<string>:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.

df1
    A   B
1  A1  B1
2  A2  B2

df2
    A   B
3  A3  B3
4  A4  B4

df1.append(df2)
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

# Combining datasets: Merge and Join

[link]('https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html')

- high performance in-memory join and merge operations
- main interface is pd.merge

In [1]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

## Relational Algebra
- a set of rules for manipulating relational data / link data from different sources

## Categories of joins
- one to one
- many to one
- many to many
- all types accessed via pd.merge()
- type of join depends on input data

### one-to-one joins

In [2]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display('df1', 'df2')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [3]:
# to combine

df3 = pd.merge(df1, df2)
df3

# recognises overlapping employee column and uses it as a mapping key

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### many-to-one joins
- two key cols contain duplicate entries and this join will preserve it

In [4]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                     'supervisor': ['Carly', 'Guido', 'Steve']})
display('df3', 'df4', 'pd.merge(df3, df4)')

df3
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

df4
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

pd.merge(df3, df4)
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

### many-to-one join
- preserves duplicates in key cols in left and right arrays

In [5]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})
display('df1', 'df5', "pd.merge(df1, df5)")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df5
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

pd.merge(df1, df5)
  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

### Specification of the merge key
- pd.merge( ) looks for 1+ matching col names between 2 inputs and uses this as the key
- if col names dont match up cleanly, can implement options:

### the *on* keyword
- if both arrays have the specified col name

In [6]:
display('df1', 'df2', "pd.merge(df1, df2, on='employee')")

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df2
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

pd.merge(df1, df2, on='employee')
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

### The *left_on* and *right_on* keywords
- merge two datasets with two different col names
- eg, say name col is called "employee" in df1 and "names" in df2

In [8]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})

df1_3 = pd.merge(df1, df3, left_on = "employee", right_on="name")    
                
display('df1', 'df3', 'df1_3')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

df1_3
  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [10]:
# drop duplicate name column
df1_3 = pd.merge(df1, df3, left_on = "employee", right_on="name").drop('name', axis = 1)   
                
display('df1', 'df3', 'df1_3')

df1
  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

df1_3
  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

### The *left_index* and *right_index* keywords
- merge on an index

In [11]:
#datasets
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
display('df1a', 'df2a')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df2a
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [13]:
# use index as the key to merge by specifying left_ and right_ index

df1a_2a = pd.merge(df1a, df2a, left_index=True, right_index=True)
df1a_2a

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [14]:
# alternative using join() method

df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [17]:
# mix indices

display('df1a', 'df3')

df1a
                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

df3
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [18]:
pd.merge(df1a, df3, left_on='employee', right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

## Specifying set arithmetic for joins
- the type of set arithmetic used in the join
- issue arises when a value appears in one key col but not the other

In [20]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])

display('df6', 'df7')

df6
    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

df7
     name drink
0    Mary  wine
1  Joseph  beer

In [21]:
pd.merge(df6, df7)

   name   food drink
0  Mary  bread  wine

shows the intersection of inputs: ***inner join***

In [22]:
# specify inner join

pd.merge(df6, df7, how='inner')

   name   food drink
0  Mary  bread  wine

- other join options: ***outer, left, right***

In [24]:
# outer join, unifies all input cols and fills missing with NA
pd.merge(df6, df7, how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [26]:
# left join keeps **entries** in the left array

pd.merge(df6, df7, how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [27]:
# right join keeps **entries** in the right array
pd.merge(df6, df7, how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

## Overlapping column names: the *suffixes* keyword
- if two input dataframes have conflicting col names

In [28]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1,2,3,4]})

df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3, 1, 4, 2]})

display('df8', 'df9')

df8
   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

df9
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [29]:
pd.merge(df8, df9, on="name")

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [31]:
# change suffixes
pd.merge(df8, df9, on="name", suffixes=["_L", "_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

## Example data

In [36]:
import numpy as np
import pandas as pd

pop_url = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv?raw=True'
pop = pd.read_csv(pop_url)

areas_url = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv?raw=True'
areas = pd.read_csv(areas_url)

abbrevs_url = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv?raw=True'
abbrevs = pd.read_csv(abbrevs_url)

In [37]:
display('pop.head(5)', 'areas.head(5)', 'abbrevs.head(5)')

pop.head(5)
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head(5)
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head(5)
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

rank US states and territories by 2010 pop density

In [91]:
merge_1 = pd.merge(pop, abbrevs, how='outer',
                  left_on='state/region', right_on='abbreviation').drop('abbreviation', axis=1)
merge_1.head(5)

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [92]:
# check for mismatches
merge_1.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [93]:
# show which state/pop are null

merge_1[merge_1['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [94]:
# check which regions and states do not have cirresponding entries

merge_1.loc[merge_1['state'].isnull(), 'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [95]:
# PR and USA do not have state "abbreviations"
merge_1.loc[merge_1['state/region'] == 'PR', 'state'] = 'Peurto Rico'
merge_1.loc[merge_1['state/region'] == "USA", 'state'] = 'United States'

In [96]:
merge_1.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [100]:
merge_2 = pd.merge(merge_1, areas, on = 'state', how = 'left')
merge_2.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [101]:
merge_2.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [102]:
merge_2['state'][merge_2['area (sq. mi)'].isnull()].unique()

array(['Peurto Rico', 'United States'], dtype=object)

In [103]:
merge_2.dropna(inplace=True)
merge_2.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [135]:
# select year 
data2010 = merge_2[(merge_2['year'] == 2010) & (merge_2['ages'] == 'total')]
data2010.head(5)

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [138]:
df2 = data2010.set_index('state')
df2.head(5)

           state/region   ages  year  population  area (sq. mi)
state
Alabama              AL  total  2010   4785570.0        52423.0
Alaska               AK  total  2010    713868.0       656425.0
Arizona              AZ  total  2010   6408790.0       114006.0
Arkansas             AR  total  2010   2922280.0        53182.0
California           CA  total  2010  37333601.0       163707.0

In [139]:
density  = df2['population'] / df2['area (sq. mi)']
density.head(5)

state
Alabama        91.287603
Alaska          1.087509
Arizona        56.214497
Arkansas       54.948667
California    228.051342
dtype: float64

In [140]:
density.tail()

state
Virginia         187.622273
Washington        94.557817
West Virginia     76.519582
Wisconsin         86.851900
Wyoming            5.768079
dtype: float64